# Створення таблиці пропорційної заміни
substitution_table = {
    'А':100,
    'Б':101,
    'В':102,
    'Г':103,
    'Д':104,
    'Е':105,
    'Є':106,
    'Ж':107,
    'З':108,
    'И':109,
    'І':110,
    'Ї':111,
    'Й':112,
    'К':113,
    'Л':114,
    'М':115,
    'Н':116,
    'О':117,
    'П':118,
    'Р':119,
    'С':120,
    'Т':121,
    'У':122,
    'Ф':123,
    'Х':124,
    'Ц':125,
    'Ч':126,
    'Ш':127,
    'Щ':128,
    'Ь':129,
    'Ю':130,
    'Я':131,
    'а':200,
    'б':201,
    'в':202,
    'г':203,
    'д':204,
    'е':205,
    'є':206,
    'ж':207,
    'з':208,
    'и':209,
    'і':210,
    'ї':211,
    'й':212,
    'к':213,
    'л':214,
    'м':215,
    'н':216,
    'о':217,
    'п':218,
    'р':219,
    'с':220,
    'т':221,
    'у':222,
    'ф':223,
    'х':224,
    'ц':225,
    'ч':226,
    'ш':227,
    'щ':228,
    'ь':229,
    'ю':230,
    'я':231,
    ' ':232
}

# Функція для шифрування відкритого тексту
def encrypt(text, substitution_table):
    encrypted_text = ''
    for char in text:
        if char in substitution_table:
            encrypted_text += str(substitution_table[char]) + ' '
        else:
            encrypted_text += char
    return encrypted_text

# Напишіть свій відкритий текст та збережіть його у файл
open_text = "Вулиця Соловївська має свій початок ще із часів панщини Старші люди говорять що назву дали таку бо тут гніздилося багато соловїв і влітку вся вулиця яка простягається на 10км наповнювалася співом цих дивовижних птахів"
with open('textToEncrypt.txt', 'w', encoding='utf-8') as file:
    file.write(open_text)

# Зашифруйте відкритий текст та запишіть його у файл криптограми
encrypted_text = encrypt(open_text, substitution_table)
with open('encrypted.txt', 'w', encoding='utf-8') as file:
    file.write(encrypted_text)

print("Текст:\n" + open_text)
print("\nЗашифрований текст:\n" + encrypted_text)